[
	{
		"title": [
			"Açaí"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Açaí contains theobromine, the primary cause of chocolate poisoning in dogs. Dogs should avoid açaí berries and any foods containing açaí.",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple"
		]
	},
	{
		"title": [
			"Alcohol",
			"Beer",
			"Champagne",
			"Gin",
			"Liquor",
			"Rum",
			"Vodka",
			"Whiskey",
			"Wine"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "All types of alcohol are toxic to dogs—including beer, champagne, gin, liquor, rum, vodka, whiskey, and wine. Dogs should not consume any amount of any type of alcohol.",
		"links": [
			"https://www.akc.org/expert-advice/vets-corner/is-alcohol-dangerous-for-dogs/"
		]
	},
	{
		"title": [
			"Apples"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Apples are a safe treat for dogs, but dogs should avoid the core, stem, and seeds, because they can be a choking hazard. The seeds also contain small amounts of cyanide, a toxic substance. <strong>Dogs can eat bite-size pieces of peeled apples, without the core, seeds, or stem.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-apples"
		]
	},
	{
		"title": [
			"Apricots"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Apricots aren't toxic to dogs. However, the skin and pit can be a choking hazard and get stuck in your dog's digestive tract, and the pit contains small amounts of cyanide, which is toxic to dogs. Apricots have a high amount of sugar, and therefore, should only be given to dogs in moderation. <strong>Dogs can eat bite-size pieces of apricot flesh, without the peel or pit.</strong>",
		"links": [
			"https://trupanion.com/pet-care/fruits-and-veggies-for-pets",
			"https://www.hillspet.com/pet-care/nutrition-feeding/can-dogs-and-cats-eat-fruit",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/apricot"
		]
	},
	{
		"title": [
			"Artichokes"
		],
		"edible": "safe",
		"processed": false,
		"highfat": false,
		"canned": false,
		"carb": true,
		"content": "Artichokes are not toxic for dogs, so they can safely eat them. Due to their toughness, dogs may have difficulty chewing and digesting artichokes, so they should be cooked thoroughly and cut into small pieces. <strong>Dogs can eat bite-size pieces of plain, unseasoned, cooked artichokes.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Asparagus"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Asparagus is not toxic for dogs, so they can safely eat it. Due to its toughness, dogs may have difficulty chewing and digesting asparagus. <strong>Dogs can eat bite-size pieces of plain, unseasoned, cooked asparagus.</strong> <strong>NOTE:</strong> Keep dogs away from asparagus plants, called asparagus fern, as they are toxic for dogs.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-asparagus"
		]
	},
	{
		"title": [
			"Aspartame"
		],
		"edible": "caution",
		"processed": true,
		"highfat": false,
		"canned": false,
		"content": "Aspartame is a sweetener and sugar substitute found in many fruits and vegetables, as well as other human food products, especially sugar-free products like chewing gum, toothpaste, breath mints, chewable vitamins, and baked goods. It is not toxic to dogs and cats, but many food items that contain aspartame contain other ingredients that are, so extreme caution should be taken. <strong>Aspartame is not toxic to dogs.</strong>",
		"links": [
			"http://www.vetstreet.com/our-pet-experts/the-skinny-on-xylitol-stevia-aspartame-and-other-sugar-free-stuff"
		]
	},
	{
		"title": [
			"Avocados"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Avocados contain a toxin called persin, which can cause serious health problems in many animals, and can even be fatal. Although dogs seem to be unaffected by persin, it has been found to be poisonous to some animals like birds, horses, and cattle. Persin is found in the avocado fruit, pits, leaves, and the actual plant as well. Avocados also have a high fat content, which can cause dogs to get gastrointestinal upset and pancreatitis. Lastly, the pit in the center of the fruit can create an obstruction in your dogs' gastrointestinal tract, and it contains small amounts of cyanide, which although unlikely to do damage, is just another reason to avoid giving your dog avocados.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-avocado",
			"https://dogster.com/dog-food/can-dogs-eat-avocado"
		]
	},
	{
		"title": [
			"Bananas"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Bananas are a safe treat for dogs, as long as the peel is removed, as they are hard to digest, can be a choking hazard, or can cause a gastrointestinal blockage. Like many other fruits, bananas contain a fair amount of sugar, so moderation is key. A whole banana is generally too big of a serving for a dog. <strong>Dogs can eat bite-size pieces of peeled bananas.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-bananas",
			"https://dogster.com/dog-food/can-dogs-eat-bananas-are-bananas-good-for-dogs"
		]
	},
	{
		"title": [
			"Beans",
			"Black Beans",
			"Chickpeas",
			"Edamame",
			"Kidney Beans",
			"Lentils",
			"Pinto Beans",
			"Soybeans"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Dogs can eat most beans and lentils, as long as they are plain, unseasoned, and cooked. Uncooked beans contain a toxin called PHA (phytohemagglutinin) which is dangerous to dogs, so dogs should never eat uncooked beans. Cooking beans helps to neutralize the PHA. Fava beans, or broad beans, tend to have high levels of this toxin, even after cooking. This may be because the bean is large and has tougher skin, which may make the bean more difficult to cook properly. Dogs should never eat canned beans, baked beans, or refried beans, due to their troublesome ingredients, including salt, chemical preservatives, and seasonings that are dangerous for dogs like garlic, onions, and hot peppers. <strong>NOTE:</strong> Though coffee beans are not considered beans, it's important to note that coffee beans are very dangerous for dogs, and if consumed, can cause them to experience neurological damage and even death.",
		"links": [
			"https://trupanion.com/pet-care/can-dogs-eat-beans",
			"https://www.purina.com/articles/dog/nutrition/can-dogs-eat-beans"
		]
	},
	{
		"title": [
			"Beets"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Beets are non-toxic for dogs. Dogs can eat fresh beets, but should avoid canned beets due to the presence of added salt and preservatives, which can irritate a dog's digestive system. <strong>Dogs can eat fresh, plain beets.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Bell Peppers"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Bell peppers are a non-toxic, safe snack for dogs. The outer skin of a bell pepper can be tough and difficult to chew, so you can steam or puree the pepper to make it easier for your dog to consume and digest. The seeds and stems can cause indigestion and should be removed. In general, large dogs should eat half of a pepper, at the most, and small dogs should eat a quarter of a pepper, at the most. Dogs should never eat spicy peppers, such as jalapeño or Chili peppers. <strong>Dogs can eat bite-size pieces of plain, unseasoned bell pepper—cooked, frozen, or raw.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-bell-peppers"
		]
	},
	{
		"title": [
			"Blackberries"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Blackberries are safe for dogs to eat, but only in very small quantities due to their high level of natural xylitol, an all-natural sweetener found in many fruits and vegetables, as well as other human food products, which can be toxic to dogs. <strong>Dogs can eat blackberries in very small quantities.</strong>",
		"links": [
			"https://trupanion.com/pet-care/can-dogs-eat-blackberries"
		]
	},
	{
		"title": [
			"Blueberries"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Blueberries are a great source of vitamins, minerals, antioxidants, and more, and have been shown to improve the health of animals, as well as humans. This fruit is a safe snack for both large and small dogs, and most pups love them. <strong>Dogs can eat either fresh or frozen blueberries.</strong> They do not need to be cut up, but do use caution, especially with smaller dogs, as a choking risk does exist.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-blueberries"
		]
	},
	{
		"title": [
			"Bread",
			"Bagels",
			"Croissants",
			"English Muffins",
			"Pita Bread",
			"Pretzels",
			"Rolls"
		],
		"edible": "caution",
		"processed": true,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Bread is not toxic to dogs, and plain white or wheat bread is unlikely to harm your dog if they eat a bite, but bread is not very healthy for dogs and is best to be avoided. Additionally, bread dough can be very dangerous to dogs, as the yeast can cause it to keep expanding inside the dog's stomach, which can cause bloating and lead to dangerous complications. The yeast also produces ethanol, which can cause alcohol poisoning. Dogs should especially avoid buttered bread and rich bread products such as croissants. Their high fat content can cause dogs to experience stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs shouldn't eat bread.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-bread",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-bread"
		]
	},
	{
		"title": [
			"Broccoli"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Broccoli is a safe treat for dogs, in small amounts. Broccoli florets contain a substance called isothiocyanates, which improves the intestinal muscle's ability to push food and waste through the gastrointestinal tract. This can cause mild-to-potentially-severe gastric irritation in some dogs, with symptoms ranging from gas to diarrhea. Broccoli stalks can also cause a gastrointestinal obstruction, especially in small dogs. <strong>Dogs can eat bite-size pieces of plain, unseasoned broccoli—cooked, frozen, or raw.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-broccoli"
		]
	},
	{
		"title": [
			"Brussels Sprouts"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Brussels sprouts are a safe treat for dogs, in small amounts. Brussels sprouts contain a substance called isothiocyanates, which improves the intestinal muscle's ability to push food and waste through the gastrointestinal tract. This can cause mild-to-potentially-severe gastric irritation in some dogs, with symptoms ranging from gas to diarrhea. Brussels sprouts should be served cooked, as raw sprouts can be difficult for dogs to digest. <strong>Dogs can eat bite-size pieces of plain, unseasoned, cooked Brussels sprouts.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-brussels-sprouts"
		]
	},
	{
		"title": [
			"Butter",
			"Margarine"
		],
		"edible": "caution",
		"processed": true,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products, nor should they eat processed foods like margarine.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cheese"
		]
	},
	{
		"title": [
			"Cabbage"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Plain, cooked cabbage is perfectly safe for dogs to eat in limited portions.</strong> Too much cabbage can lead dogs to develop gas and, less commonly, a swollen thyroid.",
		"links": [
			"https://trupanion.com/pet-care/fruits-and-veggies-for-pets"
		]
	},
	{
		"title": [
			"Cantaloupe"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Cantaloupe and honeydew melon are excellent, nutritious, low-calorie snacks for dogs. Their high water and fiber content promote healthy digestion and prevent constipation and dehydration. Melon rinds, however, are tough and fibrous and should not be given to dogs. Ingesting rinds or seeds can put dogs at risk of experiencing gastrointestinal upset, choking, or even having a gastrointestinal impaction. <strong>Dogs can eat bite-size pieces of cantaloupe flesh.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cantaloupe"
		]
	},
	{
		"title": [
			"Melon",
			"Honeydew Melon"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Cantaloupe and honeydew melon are excellent, nutritious, low-calorie snacks for dogs. Their high water and fiber content promote healthy digestion and prevent constipation and dehydration. Melon rinds, however, are tough and fibrous and should not be given to dogs. Ingesting rinds or seeds can put dogs at risk of experiencing gastrointestinal upset, choking, or even having a gastrointestinal impaction. <strong>Dogs can eat bite-size pieces of cantaloupe flesh.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cantaloupe"
		]
	},
	{
		"title": [
			"Carrots"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Carrots are a safe snack for dogs. Cold or frozen carrots are cheap and edible chew toys for dogs, can help relieve teething discomfort for puppies, and can help improve your dog's dental health, in general. Dogs shouldn't eat whole carrots, however, as they can be a choking hazard. <strong>Dogs can eat bite-size pieces of plain, unseasoned carrots—cooked, frozen, or raw.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-carrots-are-carrots-good-for-dogs",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-carrots"
		]
	},
	{
		"title": [
			"Cat Food"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "<strong>Dogs aren't usually harmed by sneaking some cat food now and then, but it is unhealthy for them to eat on a regular basis.</strong> Cats and dogs have different dietary requirements. Cat food is much higher in fat and meat-based protein than dog food, which is likely what makes it so appealing to dogs. This imbalance can lead to gastrointestinal upset, obesity, and pancreatitis, which requires immediate veterinary care. Additionally, the high protein levels can be hard on their liver and kidney. Wet cat food also often contains tuna, which can be high in mercury, especially compared to other types of fish. If your dog regularly gets into cat food, it is best change where you keep your cat's food or where and how you feed your cat. <strong>NOTE:</strong> Just as it is dangerous to feed only cat food to dogs, cats cannot survive on dog food alone. Dog food lacks sufficient vitamin A and taurine, two nutrients cats need to live healthy lives. Dog food is also deficient in arachidonic acid and lacks the adequate meat-protein levels that cats need.",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-cat-food",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cat-food"
		]
	},
	{
		"title": [
			"Celery"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Plain celery is a safe treat for dogs. <strong>Dogs can eat bite-size pieces of plain, unseasoned celery—cooked or raw.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-celery-is-celery-good-for-dogs",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-celery"
		]
	},
	{
		"title": [
			"Cheese",
			"Asiago Cheese",
			"Blue Cheese",
			"Brie Cheese",
			"Cheddar Cheese",
			"Colby Jack Cheese",
			"Cottage Cheese",
			"Cream Cheese",
			"Feta Cheese",
			"Gorgonzola Cheese",
			"Mascarpone Cheese",
			"Mozzarella Cheese",
			"Parmesan Cheese",
			"Pepper Jack Cheese",
			"Ricotta Cheese",
			"Swiss Cheese"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cheese"
		]
	},
	{
		"title": [
			"Cherries"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Cherry pits, stems, and leaves contain cyanide, which is poisonous and potentially lethal if consumed in high enough quantities. Cherry pits are also be a choking hazard and can get lodged in a dog's digestive tract and cause intestinal blockages. Dogs should not eat maraschino cherries, either, due to their high sugar content.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-have-cherries",
			"https://trupanion.com/pet-care/fruits-and-veggies-for-pets",
			"https://www.hillspet.com/pet-care/nutrition-feeding/can-dogs-and-cats-eat-fruit",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/cherry"
		]
	},
	{
		"title": [
			"Chicken Meat",
			"Poultry"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Plain, unseasoned, skinless, boneless, cooked chicken is not toxic to dogs, as long as it's cooked. Feeding dogs raw chicken puts them at risk of salmonella or bacterial infections. Chicken skin and bones should be avoided, however. Chicken skin is full of fat, which can lead to digestive issues and even pancreatitis, and chicken bones are very brittle and if ingested, can lead to choking, fractured teeth, or gastrointestinal obstruction or perforation, especially if they splinter. Dogs should never eat chicken that was cooked with butter or oils or seasoned with salt, pepper, herbs, or spices. For dogs, this is a recipe for unpleasant digestive upset at best, and pancreatitis at worst. <strong>Dogs can eat bite-size pieces of plain, unseasoned, skinless, boneless, cooked chicken, but should avoid chicken bones.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-chicken"
		]
	},
	{
		"title": [
			"Chocolate",
			"Cocoa"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Chocolate is toxic to dogs. It contains theobromine and caffeine, both of which can speed the heart rate and stimulate the nervous system of dogs. <strong>Dogs should not eat any amount of any type of chocolate.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-chocolate"
		]
	},
	{
		"title": [
			"Coconut",
			"Coconut Oil"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Coconut is non-toxic to dogs, but it does contain medium chain triglycerides, which may cause some gastrointestinal upset and bloating. Dogs should avoid coconut water, due to its high levels of potassium. <strong>Dogs can eat coconut oil as well as bite-size pieces of coconut meat.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-coconut"
		]
	},
	{
		"title": [
			"Coffee",
			"Tea"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Coffee and tea can contain caffeine and other substances that are toxic to dogs. Caffeine stimulates dogs' nervous systems, and even a small amount can lead to a number of symptoms, including seizures, tremors, lung failure, abnormal heart rhythm, and even death. <strong>Dogs should not ingest coffee or tea in any form.</strong>",
		"links": [
			"https://www.healthline.com/nutrition/human-foods-for-dogs",
			"https://www.petpoisonhelpline.com/poison/caffeine"
		]
	},
	{
		"title": [
			"Corn"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "While corn has many nutritional benefits and is safe for your dog in small amounts, corn on the cob is a choking hazard and can cause a serious intestinal blockage. Even small dogs, with enough determination and\/or time, can chew a corn cob down small enough to swallow it. <strong>Dogs can eat plain, unseasoned, cooked corn, without the cob.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-corn",
			"https://dogster.com/dog-food/can-dogs-eat-corn"
		]
	},
	{
		"title": [
			"Cranberries"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Cranberries are not toxic for dogs, but too many cranberries can lead to an upset stomach and over time, can lead to the development of calcium oxalate stones in their bladders. Dried cranberries are also safe, but are sometimes mixed with other dried fruits, like raisins, which are very toxic to dogs. Cranberry sauce should be avoided, as it is high in sugar, which can cause gastrointestinal upset, and some recipes include grapes, raisins, or currants, which are toxic to dogs. Recipes that use brandy are also problematic, as alcohol is toxic to dogs, as well. <strong>Dogs can eat plain fresh or dried cranberries, but should avoid cranberry sauce. Be careful not to let your dog eat raisins, which can easily be mistaken for dried cranberries.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cranberries"
		]
	},
	{
		"title": [
			"Cucumbers"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Cucumbers are a safe, hydrating treat for dogs, as long as they are cut into bite-size pieces, and fed in moderation. A whole cucumber is generally too big of a serving for a dog. However, dogs should not eat pickled cucumbers (AKA pickles), due to their added salt and sugar. <strong>Dogs can eat bite-size pieces of plain, fresh cucumbers.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cucumbers",
			"https://dogster.com/dog-food/can-dogs-eat-cucumbers"
		]
	},
	{
		"title": [
			"Dairy"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-drink-milk",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-yogurt",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cheese"
		]
	},
	{
		"title": [
			"Dragon Fruit",
			"Pitaya"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Dragon fruit, also known as pitaya, is not toxic to dogs, but is high in sugar and therefore, should only be fed to dogs in moderation. Be sure to remove the rubbery, spiky outer peel of the fruit. <strong>Dogs can eat a few bite-size pieces of peeled dragon fruit flesh.</strong>",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/pitaya"
		]
	},
	{
		"title": [
			"Eggplant"
		],
		"edible": "caution",
		"processed": false,
		"highfat": false,
		"canned": false,
		"content": "Eggplant belongs to the nightshade family of vegetables, which includes tomatoes. Like unripe tomatoes, raw eggplant contains solanine, a compound that is toxic to dogs. Dogs should never eat raw eggplant. Cooking an eggplant reduces the levels of solanine. Dogs should never eat fried eggplant, or any other type of food fried in oil or with any seasonings. Giving a dog too many carbohydrates can result in obesity or other health problems, and diabetic dogs should never eat eggplant because they can cause blood sugar spikes. <strong>Dogs can eat small amounts of bite-size pieces of plain, unseasoned, unsalted, cooked eggplant.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Eggs"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Dogs can eat eggs as long as they are cooked thoroughly.</strong> Raw eggs may contain a type of bacteria called salmonella, which can cause food poisoning in both humans and dogs.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-eggs"
		]
	},
	{
		"title": [
			"Figs"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "A fig tree's white, milky sap, present especially in the leaves and all parts of the fruit, contains an enzyme called ficin. The ficin in fresh fig sap can spur allergic skin reactions in humans, but is also known to cause similar rashes, irritation, and itching when consumed by dogs. It's best to avoid giving containing fig to dogs.",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple"
		]
	},
	{
		"title": [
			"Fish",
			"Salmon",
			"Whitefish",
			"Herring",
			"Walleye",
			"Flounder",
			"Arctic Char",
			"Sardines"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dogs can eat shorter-lived species of fish like salmon, ocean whitefish, lake whitefish, herring, walleye, flounder, sardines, and Arctic char. Longer-lived fish species, like tuna and swordfish, can contain heavy metals like mercury, which builds up in the fish's system over time. Dogs should only be fed cooked fish, as raw fish can carry harmful parasites and bacteria like salmonella and listeria. Fish cooked in too much oil can cause gastrointestinal upset in dogs, or even lead to serious illness such as pancreatitis. Fish bones are small, brittle, and dangerous, and can lodge themselves in your dog's mouth, throat, stomach, and intestines, sometimes even perforating the organ wall. Not only is this painful, it can also result in an expensive visit to the veterinarian. <strong>Dogs can eat bite-size pieces of plain, unseasoned, deboned, shorter-lived species of fish that is cooked without oil or butter.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-fish",
			"https://dogster.com/dog-food/sardines-for-dogs"
		]
	},
	{
		"title": [
			"Fried Foods",
			"Chicken Fingers",
			"Chicken Nuggets",
			"Chips",
			"Clam Cakes",
			"Corn Dogs",
			"Crab Rangoons",
			"Donuts",
			"Egg Rolls",
			"Falafel",
			"Fish and Chips",
			"French Fries",
			"Hash Browns",
			"Home Fries",
			"Mozzarella Sticks",
			"Onion Rings",
			"Potato Chips",
			"Spring Rolls",
			"Tater Tots",
			"Tortilla Chips"
		],
		"edible": "unsafe",
		"processed": true,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "While a french fry, potato chip, chicken finger or two may seem like a harmless treat to share with your dog, even a small morsel of highly-processed fatty food can create a nightmare of digestive upset that spirals into more serious problems. High-fat foods put your dog at risk of developing pancreatitis, which can lead to an emergency veterinarian visit. These foods can also delay the emptying of a dog's stomach, making a dog prone to bloating, which can also turn into an emergency situation if the stomach bloats and twists on itself — an emergency condition called \"bloat\", which is more prevalent in larger breeds. <strong>Dogs should not eat fried foods of any kind.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-french-fries"
		]
	},
	{
		"title": [
			"Garlic"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Garlic and other members of the allium family, including onions, contain thiosulfate, which is toxic to dogs but not to humans. <strong>Dogs should not eat garlic, or anything containing any amount garlic.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-garlic"
		]
	},
	{
		"title": [
			"Gatorade"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Gatorade has high amounts of sugar and salt, and therefore isn't safe for dogs. Dogs should always drink water instead of drinks like Gatorade. Dehydrated dogs should be taken to the veterinarian for proper fluid treatment.",
		"links": [
			"https://www.rover.com/blog/can-dog-drink-gatorade"
		]
	},
	{
		"title": [
			"Grapes",
			"Raisins"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Grapes and raisins are highly toxic to dogs, and ingestion can even be fatal. <strong>Dogs should not eat any amount of any type of grape or raisin.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-grapes",
			"https://dogster.com/dog-food/can-dogs-eat-grapes-what-to-know-about-grapes-and-dogs"
		]
	},
	{
		"title": [
			"Green Beans",
			"String Beans"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Green beans are a safe treat for dogs to eat, as long as they are cut into pieces, as whole green beans can be a choking hazard. <strong>Dogs can eat bite-size pieces of plain, unseasoned, cooked, raw, or frozen green beans.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-have-green-beans"
		]
	},
	{
		"title": [
			"Guava"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Guava aren't toxic to dogs, but they have a high amount of sugar, and therefore, should only be given to dogs in moderation. Additionally, guava seeds can be a choking hazard and should never be given to dogs. <strong>Dogs can eat bite-size pieces of guava fruit flesh, without the seeds or the outer peel.</strong>",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple"
		]
	},
	{
		"title": [
			"Honey"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Honey is generally safe for non-diabetic and non-obese dogs, but should be fed in small quantities due to the natural sugars. Puppies or dogs with compromised immune systems avoid honey as it may contain the presence of botulism spores. The natural sugars in honey can cause your dog to develop tooth decay. <strong>Adult dogs who are not diabetic, obese, or immune-compromised can eat small quantities of honey.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-honey"
		]
	},
	{
		"title": [
			"Hot Dogs"
		],
		"edible": "unsafe",
		"processed": true,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Dogs should not eat hot dogs. Many hot dog ingredients can be toxic to dogs, such as sodium nitrate, monosodium glutamate (MSG), sugars or artificial sweeteners, seasonings, and high amounts of salt. They're also a choking hazard, especially for big dogs that might try to swallow them without chewing them. <strong>Dogs should not eat any amount of hot dogs, cooked or uncooked.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Ice Cream",
			"Frozen Yogurt"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-ice-cream",
			"https://dogster.com/dog-food/can-dogs-eat-ice-cream"
		]
	},
	{
		"title": [
			"Ice Cubes"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Ice cubes are not dangerous for dogs to eat.</strong> It is unlikely that eating ice cubes will cause your dog to choke or suffer a chipped tooth, or bloat, although there have been cases where veterinarians were suspicious of ice cubes playing a part in dogs developing these conditions.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/are-ice-cubes-good-for-dogs"
		]
	},
	{
		"title": [
			"Hot Peppers",
			"Chili Peppers",
			"Jalapeño Peppers",
			"Serrano Peppers"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Dogs should never eat spicy peppers, such as jalapeño peppers.</strong> However, dogs can eat bite-size pieces of plain, unseasoned <em>bell</em> peppers, cooked, frozen, or raw.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Kale"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Kale is not safe for dogs to eat because it contains several potentially harmful natural compounds, including calcium oxalate and isothiocyanates. Calcium oxalate can cause health issues such as kidney disease and bladder stones, and dogs that are prone to kidney or bladder stones are especially prone to developing health complications from ingesting this compound. Isothiocyanates, which are also found in broccoli, can cause mild to potentially severe gastric irritation, and should be avoided as a regular treat. Kale can also interfere with thyroid function if fed on a regular basis. <strong>Dogs should not eat kale regularly, but accidentally eating a kale rib is unlikely to harm your dog.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-kale"
		]
	},
	{
		"title": [
			"Kiwis"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Kiwis aren't toxic to dogs, but they have a high amount of sugar, and therefore, aren't safe for dogs, especially dogs who are obese or have diabetes. <strong>Dogs can eat bite-size pieces of kiwi fruit flesh, without the seeds or the outer peel.</strong>",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple"
		]
	},
	{
		"title": [
			"Citrus Fruits",
			"Lemons",
			"Limes",
			"Oranges",
			"Clementines",
			"Grapefruit",
			"Kumquats",
			"Persimmons",
			"Tangerines"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Citrus fruits, including the seeds and peel, and citrus plants including the stems and leaves all contain citric acid, which can cause digestive upset and other more serious issues. <strong>Dogs should not eat citrus fruits or ingest citrus oils of any kind.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-oranges",
			"https://trupanion.com/pet-care/fruits-and-veggies-for-pets",
			"https://www.hillspet.com/pet-care/nutrition-feeding/can-dogs-and-cats-eat-fruit",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/grapefruit",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/lemon",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/lime",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/orange"
		]
	},
	{
		"title": [
			"Greens",
			"Arugula Greens",
			"Green Leaf Lettuce",
			"Iceberg Lettuce",
			"Lettuce Greens",
			"Red Leaf Lettuce",
			"Romaine Lettuce"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Dogs can eat romaine, arugula, or iceberg lettuce, but should avoid kale and spinach. Romaine, arugula, and iceberg lettuce is a hydrating, crunchy snack that many dogs love. Spinach is very high in oxalic acid, which blocks the body's ability to absorb calcium and can lead to kidney damage. Kale contains several potentially harmful natural compounds, including calcium oxalate—which could lead to kidney and bladder stones—and isothiocyanates, that can cause mild to potentially severe gastric irritation. <strong>Dogs can eat bite-size pieces of plain lettuce with no dressing.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-lettuce"
		]
	},
	{
		"title": [
			"Mangoes"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Mangoes aren't toxic to dogs. However, the skin and pit can be a choking hazard and get stuck in your dog's digestive tract, and the pit contains small amounts of cyanide, which is toxic to dogs. Mangoes have a high amount of sugar, and therefore, should only be given to dogs in moderation. <strong>Dogs can eat bite-size pieces of mango flesh, without the peel or pit.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-mango",
			"https://dogster.com/dog-food/can-dogs-eat-mango"
		]
	},
	{
		"title": [
			"Marshmallows"
		],
		"edible": "unsafe",
		"processed": true,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Marshmallows are not safe for dogs and are even toxic if they contain xylitol (an artificial sugar). Xylitol can be extremely harmful, even if ingested in small quantities. Marshmallows are also full of sugar, which is not healthy for dogs. Lastly, marshmallows, especially mini marshmallows, can be a choking hazard. <strong>Dogs should not eat any amount of marshmallows or foods containing marshmallow.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-marshmallows"
		]
	},
	{
		"title": [
			"Red Meat",
			"Beef",
			"Steak"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Dogs can eat bite-size pieces of plain, unseasoned, boneless, cooked red meat, but should avoid meat bones.</strong> Any meat that is high in fat or cooked with butter or oils or seasoned with salt, pepper, herbs, or spices can be a recipe for unpleasant digestive upset at best, and pancreatitis at worst. Dogs should not be given raw meat or meat bones. Not only can they carry bacteria like salmonella or e-coli, meat bones can also be a choking hazard and cause dogs digestive upset, fractured teeth, or gastrointestinal obstruction or perforation, especially if they splinter.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/dog-eat-steak-bones"
		]
	},
	{
		"title": [
			"Bones",
			"Beef Bones",
			"Chicken Bones",
			"Ham Bones",
			"Lamb Bones",
			"Meat Bones",
			"Pork Bones",
			"Pork Chop Bones",
			"Steak Bones",
			"Turkey Bones"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Contrary to popular belief, dogs should not be given bones. Not only can meat bones carry bacteria like salmonella or e-coli, they are also likely to splinter and crack when your dog chews on them—regardless of whether they are cooked or uncooked. They can become a choking hazard and cause also dogs digestive upset, fractured teeth, or gastrointestinal obstruction or perforation. Though giving dogs the most natural option always seems like the best choice, in the case of meat bones, it's best to opt for a high-quality dental bone as an alternative. <strong>Dogs should never eat any type of meat bone—cooked or uncooked.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/dog-eat-steak-bones",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-pork-bones"
		]
	},
	{
		"title": [
			"Milk"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-drink-milk"
		]
	},
	{
		"title": [
			"Mushrooms",
			"Champignon Mushrooms",
			"Chanterelle Mushrooms",
			"Cremini Mushrooms",
			"Maitake Mushrooms",
			"Morel Mushrooms",
			"Oyster Mushrooms",
			"Porcini Mushrooms",
			"Portabella Mushrooms",
			"Shiitake Mushrooms"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Dogs should not eat mushrooms, especially wild mushrooms, as wild mushrooms can be toxic to dogs, even if they are not toxic to humans. Although only around 50-100 of the 10,000 species of mushrooms recognized worldwide are known to be toxic, the mushrooms that are toxic are very toxic, and are often difficult to distinguish from the non-toxic varieties. Veterinarians recommend treating all wild mushrooms as potentially toxic and a veterinary emergency. Store-bought mushrooms are likely safe for dogs to consume, but out of an abundance of caution, it's better to keep dogs away from mushrooms.<strong>Dogs shouldn't eat any amount of any type of mushroom.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-mushrooms",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-mushroom",
			"https://dogster.com/dog-food/can-dogs-eat-mushrooms-what-to-know-about-dogs-and-mushrooms",
			"https://www.pethealthnetwork.com/dog-health/dog-toxins-poisons/dogs-and-mushrooms"
		]
	},
	{
		"title": [
			"Nectarines"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Nectarines aren't toxic to dogs. However, the skin and pit can be a choking hazard and get stuck in your dog's digestive tract, and the pit contains small amounts of cyanide, which is toxic to dogs. Nectarines have a high amount of sugar, and therefore, should only be given to dogs in moderation. <strong>Dogs can eat bite-size pieces of nectarine flesh, without the peel or pit.</strong>",
		"links": [
			"https://trupanion.com/pet-care/fruits-and-veggies-for-pets",
			"https://www.hillspet.com/pet-care/nutrition-feeding/can-dogs-and-cats-eat-fruit"
		]
	},
	{
		"title": [
			"Nuts",
			"Almonds",
			"Brazil Nuts",
			"Cashews",
			"Chestnuts",
			"Hazelnuts",
			"Macadamia Nuts",
			"Pecans",
			"Pine Nuts",
			"Pistachios",
			"Walnuts"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Nuts are not a safe snack for dogs, due to their high fat content, and some nuts are even toxic. Macadamia nuts are very toxic to dogs. Dogs should not eat any amount of macadamia nuts. Eating high fat foods, like nuts, puts dogs at risk of becoming obese and developing pancreatitis, which can lead to an emergency visit to the veterinarian. Some nuts, like almonds, are a choking hazard and can cause gastrointestinal obstruction, especially in small dogs. Peanuts and cashews, while still high in fat, are safe for dogs in very small quantities, as long as they are plain, unsalted, and unseasoned. <strong>Dogs should avoid eating nuts, especially macadamia nuts, which are toxic to dogs.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-nuts",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-almonds",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-macadamia-nuts"
		]
	},
	{
		"title": [
			"Oatmeal"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Oatmeal can be a safe food for dogs. The high fiber content of oatmeal can cause your dog gastrointestinal upset, including gas, diarrhea, and vomiting, especially if your dog is not used to eating fiber. Eating too much oatmeal can also cause dogs to develop bloat, a life-threatening condition which leads to an emergency veterinarian visit. Dogs should only eat plain oatmeal. Some oatmeal flavorings and add-ins, like raisins, are toxic to dogs, and usually have high amounts of sugar, which they should not eat, or artificial sweeteners, such as xylitol, which is toxic to dogs. Dogs should not eat instant oatmeals. Dogs should only eat cooked oatmeal made with water, not dairy. Dogs are very sensitive to dairy, and their bodies have a difficult time breaking down lactose. <strong>Dogs can eat small amounts of plain, unflavored, unsweetened oatmeal cooked with water, not dairy.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-oatmeal"
		]
	},
	{
		"title": [
			"Olives"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Olives are not toxic to dogs, and can be safe in small quantities. Dogs should never be given olives with pits, as they can cause choking or gastrointestinal obstructions, and can crack teeth. Canned or pickled olives should be avoided due to their often excessive amounts of sodium, which is unhealthy for dogs and can even lead to toxicity. Olives that have seasonings, oils, or have been soaked in alcohol should never be given to dogs. Olives are high in fat, and ingesting high amounts of fat can cause dogs to develop pancreatitis, which can lead to an emergency veterinarian visit. <strong>Dogs can eat small amounts of plain, unsalted, unseasoned, pitted olives.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-olives"
		]
	},
	{
		"title": [
			"Onions",
			"Chives",
			"Cipollini Onions",
			"Green Onions",
			"Leeks",
			"Pearl Onions",
			"Red Onions",
			"Scallions",
			"Shallots",
			"Sweet Onions",
			"Vidalia Onions",
			"White Onions",
			"Yellow Onions"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Onions, scallions, shallots, or other closely related foods—whether powdered, dried, fresh, cooked, or as an ingredient in a processed food—should never be given to dogs, as they can cause them to develop a condition called hemolytic anemia. This condition impacts\/destroys a dog's red blood cells, leaving them without enough of them for healthy functioning. Severe onion poisoning in dogs can be fatal. All parts of these foods—including their juice, flesh, or leaves—can cause issues for dogs. <strong>Dogs should not eat any amount of any type of onion or related food.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-onions-what-if-your-dog-ate-onions"
		]
	},
	{
		"title": [
			"Pomegranates"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Pomegranates aren't toxic to dogs, but they have a high amount of sugar, and therefore, should only be given to dogs in moderation. <strong>Dogs can eat bite-size pieces of pomegranate fruit flesh, without the seeds or the outer peel.</strong>",
		"links": [
			"https://www.dogster.com/lifestyle/exotic-fruits-dogs-can-eat-tropical-fruits-month-acai-pomegranate-persimmon-pineapple"
		]
	},
	{
		"title": [
			"Peaches"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Peaches are a safe snack for dogs, without the pit, stem, and leaves, which all contain cyanide. The pit is also a choking hazard which can also become obstructed in your dog's gastrointestinal tract. Dogs should not eat canned or preserved peaches, due to their high sugar content and potential to contain preservatives or artificial sweeteners, which as xylitol, which is toxic for dogs. <strong>Dogs can eat bite-size pieces of plain, fresh peaches, but avoid the pit, steam, and leaves.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-peaches"
		]
	},
	{
		"title": [
			"Peanut Butter"
		],
		"edible": "caution",
		"processed": false,
		"dcm": true,
		"highfat": true,
		"canned": false,
		"content": "Most peanut butter is safe for dogs to eat in moderation. Dogs should only eat unsalted peanut butter without additives like sugars or artificial sweeteners, especially xylitol. Xylitol is a sugar substitute often found in sugar-free products like chewing gum, toothpaste, breath mints, chewable vitamins, and baked goods. Manufacturers have recently started putting it in peanut butter. It is safe for people, but toxic to dogs. Peanut butter is high in fat, and large amounts can put dogs at risk of developing pancreatitis, which can lead to an emergency veterinarian visit. <strong>Dogs can eat small amounts of unsalted peanut butter that doesn't contain any additives, sugars or artificial sweeteners, especially xylitol, which is toxic for dogs.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-peanut-butter"
		]
	},
	{
		"title": [
			"Peanuts"
		],
		"edible": "caution",
		"processed": false,
		"dcm": true,
		"highfat": true,
		"canned": false,
		"content": "Like peanut butter, peanuts are generally safe for dogs to eat in small amounts. Peanut shells are fibrous and can be a choking hazard, especially for small dogs, and therefore, dogs should only be given shelled peanuts. Peanuts are high in fat, and large amounts can put dogs at risk of developing pancreatitis, which can lead to an emergency veterinarian visit. The sodium content of salted peanuts also can be harmful, so it is best to avoid feeding salted peanuts to dogs. <strong>Dogs can eat a few unsalted, non-flavored, shelled, dry-roasted or raw peanuts as an occasional snack.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-peanuts"
		]
	},
	{
		"title": [
			"Pears"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Pears are a safe snack for dogs. Dogs should only eat pear slices, not the core or any other parts containing seeds. Pear seeds contain traces of the toxin cyanide and therefore, are toxic in large quantities. Pear seeds can also be a choking hazard for dogs. <strong>Dogs can eat bite-size pieces of plain pears, with the seeds removed.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-pears"
		]
	},
	{
		"title": [
			"Peas",
			"Green Peas",
			"Snow Peas",
			"Sugar Snap Peas"
		],
		"edible": "safe",
		"processed": false,
		"dcm": true,
		"highfat": false,
		"canned": true,
		"content": "Green peas are a safe treat for dogs and are often included as an ingredient in commercial dog food. Dogs with kidney problems should avoid peas due to their purines content. Purines are a naturally occurring chemical compound which produce uric acid that's filtered through the kidneys. Too much uric acid can lead to kidney stones and other kidney conditions, and dogs with pre-existing kidney problems are more prone to developing complications. Pea pods can be a choking hazard for dogs, and therefore dogs should only be given shelled peas. <strong>Dogs can eat plain, unseasoned, fresh, cooked, or frozen snow peas, sugar snap peas, and garden or English peas.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-peas"
		]
	},
	{
		"title": [
			"Pickles"
		],
		"edible": "unsafe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Dogs should not eat pickles due to their added salt and sugar, and potential added spices. While a bite of pickle probably won't hurt your dog, stick with plain cucumbers as a regular treat and avoid feeding pickles of any variety to dogs.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-cucumbers",
			"https://dogster.com/dog-food/can-dogs-eat-cucumbers"
		]
	},
	{
		"title": [
			"Pineapples"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Pineapple is a safe treat for dogs, but should be limited due to its high amount of natural sugar. Pineapple skin and the core should be removed as they can cause obstructions in your dog's mouth, throat, and gastrointestinal tract. Canned pineapple and the syrup its canned with should be avoided due to the high content of added sugars. <strong>Dogs can eat a few bite-size pieces of fresh, frozen, or grilled pineapple, without the skin or core.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-pineapple",
			"https://dogster.com/dog-food/can-dogs-eat-pineapple"
		]
	},
	{
		"title": [
			"Plums",
			"Prunes"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Plums and prunes aren't toxic to dogs. However, the pit and seeds contain cyanide and are a choking hazard, and should never be given to dogs. Plums and prunes are also high in sugar, and their canned or preserved versions can also contain preservatives or artificial sweeteners, which as xylitol, which is toxic for dogs. <strong>Dogs can eat a few bite-size pieces of fresh or frozen plums or prunes, without the skin, stem, or seeds.</strong>",
		"links": [
			"https://www.rover.com/blog/can-dog-eat-plums/",
			"https://petcentral.chewy.com/nutrition-pet-diet-tips-can-dogs-eat-plums/",
			"https://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants/plum"
		]
	},
	{
		"title": [
			"Popcorn"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Popcorn is not toxic to dogs, but commonly added toppings and seasonings on popcorn can be. Additionally, unpopped kernels aren't digestible and can cause digestive upset. <strong>Dogs can eat plain, unsalted, unbuttered, popped popcorn.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-popcorn"
		]
	},
	{
		"title": [
			"Pork",
			"Ham",
			"Sausage",
			"Bacon",
			"Salami",
			"Ribs"
		],
		"edible": "caution",
		"processed": true,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Pork is rich with a type of fat that is difficult for dogs to digest, which can lead to indigestion and even pancreatitis, which can be fatal. Ham, bacon, sausage, and salami are all incredibly rich, fatty foods with high salt content, which is also unhealthy for dogs. Even preservatives used in these foods are loaded with nitrates and nitrites, which are sodium-based. Too much salt can even be toxic to dogs, and can cause more serious consequences such as kidney damage, seizures, coma, and even death. Processed meats such as bacon and sausage contain known carcinogens linked to cancer. Holiday hams are even more problematic for dogs because they are usually cooked with butter or oils, seasoned with salt, pepper, herbs, or spices, or stuffed with onions, garlic, or herbs. For dogs, this is a recipe for disaster. Pork bones should also be avoided. They are very brittle and if ingested, can lead to choking, fractured teeth, or gastrointestinal obstruction or perforation, especially if they splinter. <strong>Dogs shouldn't eat pork, ham, bacon, sausage, salami, or any meat bones.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-ham",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-pork",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-pork-bones",
			"https://dogster.com/dog-food/can-dogs-eat-bacon"
		]
	},
	{
		"title": [
			"Potatoes"
		],
		"edible": "caution",
		"processed": false,
		"dcm": true,
		"highfat": false,
		"canned": false,
		"content": "White potatoes belong to the nightshade family of vegetables, which includes tomatoes. Like unripe tomatoes, raw potatoes contain solanine, a compound that is toxic to dogs. Dogs should never eat raw potatoes. Cooking a potato reduces the levels of solanine. Dogs should never eat french fries, potato chips, or any other type of potato fried in oil or with any seasonings. Giving a dog too many carbohydrates can result in obesity or other health problems, and diabetic dogs should never eat potatoes because they can cause blood sugar spikes. <strong>Dogs can eat small amounts of bite-size pieces of plain, unseasoned, unsalted, cooked potato.</strong> Sweet potatoes are a healthier alternative to white potatoes because they are much more nutritious.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-potatoes"
		]
	},
	{
		"title": [
			"Pumpkin"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Pumpkins are safe for dogs to eat. Dogs should not eat pumpkin-pie filling, however, because it usually has sugar and other additives that can be toxic to dogs. <strong>Dogs can eat plain raw, cooked, or canned pumpkin, without any sugar, spices, or other additives.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-pumpkin-what-about-other-fall-vegetables"
		]
	},
	{
		"title": [
			"Quinoa"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Dogs can eat plain, cooked, unseasoned quinoa.</strong> Previously, there was concern that a type of chemical naturally found on quinoa could be damaging to dogs, but the amount of saponin found on quinoa is typically too small to create any health problems. Washing the quinoa prior to cooking removes most of the saponin.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-quinoa"
		]
	},
	{
		"title": [
			"Radishes"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Radishes are safe for dogs in small amounts. Like carrots, these tough, hardy veggies can also serve as natural chew toys and teeth cleansers for dogs. Avoid feeding your dog wild radishes and their flowers. <strong>Dogs can eat bite-size pieces of plain, unseasoned radishes.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Raspberries",
			"Black Raspberries"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Raspberries and black raspberries are safe for dogs to eat, but they should be given in moderation due to their high level of natural xylitol, an all-natural sweetener found in many fruits and vegetables, as well as other human food products, which can be toxic to dogs. <strong>Dogs can eat raspberries in very small quantities.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-my-dog-eat-raspberries"
		]
	},
	{
		"title": [
			"Rice"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "<strong>Dogs can eat plain, unseasoned, cooked brown or white rice.</strong> However, rice, especially white rice, can raise blood sugar levels, so dogs with diabetes should only eat it in small amounts.",
		"links": [
			"https://www.healthline.com/nutrition/human-foods-for-dogs"
		]
	},
	{
		"title": [
			"Shellfish",
			"Shrimp",
			"Crab",
			"Lobster",
			"Clams",
			"Mussels",
			"Oysters",
			"Scallops"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Cooked shellfish, like shrimp, crab, lobster, clams, mussels, oysters, and scallops, is not toxic for dogs. Raw shellfish can contain harmful pathogens and should always be cooked thoroughly before consumption. Shells should be removed completely, as they can be a choking hazard or cause a gastrointestinal obstruction. Dogs should never eat fried versions of foods, like breaded and fried shrimp. <strong>Dogs can eat bite-size pieces of plain, unseasoned, shelled, cooked shellfish.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-shrimp"
		]
	},
	{
		"title": [
			"Spinach"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Spinach is not toxic for dogs, but it is very high in oxalic acid, which blocks the body's ability to absorb calcium and can lead to kidney damage. <strong>Dogs should not eat spinach regularly, but a few leaves of plain, fresh, raw spinach is unlikely to harm your dog.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-my-dog-eat-spinach"
		]
	},
	{
		"title": [
			"Squash",
			"Acorn Squash",
			"Butternut Squash",
			"Spaghetti Squash",
			"Summer Squash",
			"Winter Squash",
			"Yellow Squash"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Squash is one of the best vegetables to feed dogs. Due to its high nutrient content and low calories, fat, and cholesterol, it's a great treat for overweight dogs. <strong>Dogs can eat bite-size pieces of plain, unseasoned squash—cooked, frozen, or raw.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-zucchini"
		]
	},
	{
		"title": [
			"Strawberries"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "<strong>Dogs can eat bite-size pieces of plain, fresh or frozen strawberries.</strong> Strawberries are a safe treat for dogs. Dogs should not eat canned strawberries or strawberries in syrup.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/feed-dog-strawberries"
		]
	},
	{
		"title": [
			"Sweet Potatoes"
		],
		"edible": "safe",
		"processed": false,
		"dcm": true,
		"highfat": false,
		"canned": false,
		"content": "Sweet potatoes are a safe food for dogs, but they should be ripe, and should not be served raw. <strong>Dogs can eat bite-size pieces of plain, unseasoned, cooked, peeled, sweet potatoes.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-sweet-potatoes"
		]
	},
	{
		"title": [
			"Tomatoes"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": true,
		"content": "Tomatoes are part of the nightshade family of vegetables, and green parts of the plant including unripe tomatoes, stems, and leaves contain toxins called solanine and tomatine. Dogs should avoid pasta sauce, due to other ingredients common in pasta sauce that are toxic to dogs, such as garlic and onion. <strong>Dogs can eat bite-size pieces of red, ripe, plain tomatoes, without the stem or leaves.</strong>",
		"links": [
			"https://dogster.com/dog-food/can-dogs-eat-tomatoes",
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-tomatoes"
		]
	},
	{
		"title": [
			"Tuna"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Like swordfish, tuna is not toxic to dogs, but both are large, long-living fish, and since mercury accumulates in fish over time, they have higher levels of mercury than other types of fish, like salmon, whitefish, herring, tilapia, flounder, and Arctic char. Consuming too much mercury can result in mercury poisoning, which can cause severe, or potentially fatal, health complications. <strong>NOTE:</strong> Consumer Reports recommended that people limit their tuna consumption based on their weight. Giving your dog a small amount of long-living fish will not cause mercury poisoning, but since there are no recommendations for how much a dog can safely eat, it is best not to feed it to your dog at all.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-tuna"
		]
	},
	{
		"title": [
			"Swordfish"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Like tuna, swordfish is not toxic to dogs, but both are large, long-living fish, and since mercury accumulates in fish over time, they have higher levels of mercury than other types of fish, like salmon, whitefish, herring, tilapia, flounder, and Arctic char. Consuming too much mercury can result in mercury poisoning, which can cause severe, or potentially fatal, health complications. <strong>NOTE:</strong> Consumer Reports recommended that people limit their tuna consumption based on their weight. Giving your dog a small amount of long-living fish will not cause mercury poisoning, but since there are no recommendations for how much a dog can safely eat, it is best not to feed it to your dog at all.",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-tuna"
		]
	},
	{
		"title": [
			"Turkey Meat",
			"Poultry"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Plain, unseasoned, skinless, boneless, cooked turkey is not toxic to dogs. Turkey skin and bones should be avoided, however. Turkey skin is full of fat, which can lead to digestive issues and even pancreatitis, and turkey bones are very brittle and if ingested, can lead to choking, fractured teeth, or gastrointestinal obstruction or perforation, especially if they splinter. Dogs also should never eat holiday turkey or any turkey cooked with butter or oils or seasoned with salt, pepper, herbs, or spices. For dogs, this is a recipe for unpleasant digestive upset at best, and pancreatitis at worst. <strong>Dogs can eat bite-size pieces of plain, unseasoned, skinless, boneless, cooked turkey, but should avoid turkey bones.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-turkey"
		]
	},
	{
		"title": [
			"Watermelon"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Watermelon is a low-calorie health-food powerhouse, and at ~92% water, watermelon flesh is a great source of hydration for both humans and dogs alike. The rind, however, can cause gastrointestinal upset in dogs, and seeds can cause an intestinal blockage. <strong>Dogs can eat bite-size pieces of watermelon flesh, without the seeds or rind.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-watermelon"
		]
	},
	{
		"title": [
			"Xylitol"
		],
		"edible": "unsafe",
		"processed": true,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Xylitol is a sweetener and sugar substitute found in many fruits and vegetables, as well as other human food products, especially sugar-free products like chewing gum, toothpaste, breath mints, chewable vitamins, and baked goods. It can be extremely harmful for dogs, even if ingested in small quantities. <strong>Dogs should not eat any amount of any food containing xylitol.</strong>",
		"links": [
			""
		]
	},
	{
		"title": [
			"Yogurt"
		],
		"edible": "caution",
		"processed": false,
		"dcm": false,
		"highfat": true,
		"canned": false,
		"content": "Dairy products are a leading source of food intolerance in dogs, and many dogs are lactose intolerant, which means they have difficulty digesting it. Dogs are not meant to digest lactose after puppyhood. Dairy also has high fat content, which can also cause dogs stomach upset, or even pancreatitis, a serious and potentially fatal illness which requires veterinarian attention. <strong>Dogs should not eat dairy products.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-yogurt"
		]
	},
	{
		"title": [
			"Zucchini"
		],
		"edible": "safe",
		"processed": false,
		"dcm": false,
		"highfat": false,
		"canned": false,
		"content": "Zucchini is one of the best vegetables to feed dogs. Due to its high nutrient content and low calories, fat, and cholesterol, it's a great treat for overweight dogs. <strong>Dogs can eat bite-size pieces of plain, unseasoned zucchini—cooked, frozen, or raw.</strong>",
		"links": [
			"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-zucchini"
		]
	}
]